$("#menu").click(function() {
    $(".mobile-menu").toggleClass('active')
    $(".header__mobile-line").each(function() {
        $(this).toggleClass('active')
    })
})



let secTable = document.querySelector('.table');
const schedule = {
    'пн': {
        'Время': 'Понедельник',
        '8.40 - 9.20': 'География',
        '9.40 - 10.20': 'Математика',
        '10.40 - 11.20': 'Физическая культура',
        '11.40 - 12.20': 'Элективный курс "Уравнения и неравенства с модулем',
        '12.40 - 13.20': 'Родной язык (русский)',
    },
    'вт': {
        'Время': 'Вторник',
        '8.00 - 8.40': 'Математика',
        '8.50 - 9.30': 'Математика',
        '9.40 - 10.20': 'Экономика',
        '10.40 - 11.20': 'Английский язык',
        '11.40 - 12.20': 'ОБЖ',
        '12.40 - 13.20': 'Русский язык',
    },
    'ср': {
        'Время': 'Среда',
        '8.00 - 8.40': 'Элективный курс "Основы компьютерной алгебры"',
        '8.50 - 9.30': 'Элективный курс "Практическое право"',
        '9.40 - 10.20': 'География',
        '10.40 - 11.20': 'Математика',
        '11.40 - 12.20': 'Литература',
        '12.40 - 13.20': 'Физика',
    },
    'чт': {
        'Время': 'Четверг',
        '8.00 - 8.40': 'История',
        '8.50 - 9.30': 'Английский язык',
        '9.40 - 10.20': 'Физическая культура',
        '10.40 - 11.20': 'География',
        '11.40 - 12.20': 'Математика',
        '12.40 - 13.20': 'Математика',
    },
    'пт': {
        'Время': 'Пятница',
        '8.00 - 8.40': 'Физика',
        '8.50 - 9.30': 'Экономика',
        '9.40 - 10.20': 'Английский язык',
        '10.40 - 11.20': 'Литература',
        '11.40 - 12.20': 'История',
        '12.40 - 13.20': 'Элективный курс "Текст. Теория и практика комплекс"',
    },
    'сб': {
        'Время': 'Пятница',
        '8.00 - 8.40': 'Физическая культура(д)',
        '8.50 - 9.30': 'Литература(д)',
    },
    'вс': {
        'Воскресенье': 'Выходной'
    },
}

let nowDate = new Date();
let d = (nowDate.toLocaleString('ru', {
    weekday: 'short'
}));
let table = document.querySelector('.table__content')

for (let key in schedule[d]) {
    let tr = document.createElement('tr');
    table.appendChild(tr);
    tr.classList.toggle('table__item')
    let td = document.createElement('td');
    let td2 = document.createElement('td');
    tr.append(td)
    tr.append(td2)
    td.innerHTML = key;
    td2.innerHTML = schedule[d][key]
}